Courses/4420/Lectures/Refreshers/file-systems.org
# -*- mode: org -*-
#+DATE: 2015-08-10
#+TITLE: Refresher on FileSys
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:2
#+LINK_HOME: ../../
#+LINK_UP: ../../Lectures
#+DESCRIPTION:  Refresher on FileSys for Android Internals and Security
#+HTML_HEAD: <style> P {text-align: justify} code {font-family: monospace; font-size: 10pt;color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "%d <a href=\"../../Top/\"> Top</a> | <a href=\"index-slides.html\">Slides</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2014 %e &bull; <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> %d"))
#+STYLE: <style> P {text-align: justify} code {font-family: monospace; font-size: 10pt;color: brown;} @media screen {BODY {margin: 10%} }</style>
#+STARTUP:showeverything
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)

* File Systems

1. file-volume = content of a (hard-disk) partition organized into
   1. Directories and Files
   2. List of free blocks
   3. Parameters describing the volume

2. file system = file volume + code

1. A HDD or flash storage based file volumes are persistent.

1. A RAM-"disk" based file volumes are not persistent, but commonly
   used.

** Operations

3. mkfs -- one a given partition, make an initial file volume.  Only
   the root and lost+found directories are created. List of free
   blocks etc initialized.  Different mkfs for different fs-designs:
   mkfs.ext4, mkfs.vfat

1. fsck -- check the integrity of a file volume.

1. mount -- take an off-line file-volume and mount it on an existing
   directory, called mount-point.  Depending on the options, the
   previous contents of the mount-point becomes invisible.  The
   file-volume appears instead.

1. umount (sic) -- unmount, reverse of above.

** ext4

1. ext4 is a particular design of a Linux native file system.  Windows
   "drivers" exist but may not be reliable.  You need to download and
   install.

1. ext4 is a journaling file system.

1. Android formats its internal eMMC storage as ext4.

** vfat

1. vfat is a particular design of a Windows native file system.  Linux
   is wholly reliable with it.  vfat is now a standard part of Linux.

1. Android formats its internal flash eMMC storage as ext4, and
   removable uSD cards as (typically) vfat.

** Swap Space

1. A file volume designed for use in virtual memory (pages, segments).
1. When swap space is exhausted, machine will "crawl"
1. If machine has large amounts of physical memory (RAM), swap space
   is unused.

** Loop Device

1. Simulation of a file as a block device
1. file =ubuntu-trusty.iso= downloaded iso image

1. =# mkdir -p /root/A= create mount point
1. =# mount kubuntu-14.04-desktop-amd64.iso /root/A=

1. =% df= shows =/dev/loop1 1041408 1041408 0 100% /root/A=


* References

1. http://cecs.wright.edu/~pmateti/Courses/2350/ /CEG 2350: OS
   Concepts and Usage/ This course presents most of our prerequiste
   materials.  Lecture and lab notes are fully on-line.

   CEG 2350 Catalog Description: Introduction to Linux and Windows
   systems. GUI and Windowing Systems. Files and
   Directories. Ownership and Sharing. Programs and Processes. System
   calls, Libraries. Loading. Dynamic linking. Command Line
   Shells. Scripting languages. Regular expressions. Clients and
   Servers. Web browser clients and servers. Secure shell,
   sftp. SSL/TSL. HTTPS. System Administration. 4 credit hours. 3
   hours lectures, 2 hours labs. Prerequisites: CS 1180 or CS 2170
   (older numbers CS 240 or CS 220) or equivalent.

1. http://www.all-things-android.com/content/understanding-android-file-hierarchy
   Pretty good.  Recommended Reading.
