Courses/4420/Lectures/Refreshers/file-systems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Refresher on FileSys</title>
<!-- 2016-09-23 Fri 20:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Refresher on FileSys for Android Internals and Security"
 />
</head>
<body>
<div id="preamble" class="status">
2015-08-10 <a href="../../Top/"> Top</a> | <a href="index-slides.html">Slides</a>
</div>
<div id="content">
<h1 class="title">Refresher on FileSys</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. File Systems</a>
<ul>
<li><a href="#sec-1-1">1.1. Operations</a></li>
<li><a href="#sec-1-2">1.2. ext4</a></li>
<li><a href="#sec-1-3">1.3. vfat</a></li>
<li><a href="#sec-1-4">1.4. Swap Space</a></li>
<li><a href="#sec-1-5">1.5. Loop Device</a></li>
</ul>
</li>
<li><a href="#sec-2">2. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> File Systems</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>file-volume = content of a (hard-disk) partition organized into
<ol class="org-ol">
<li>Directories and Files
</li>
<li>List of free blocks
</li>
<li>Parameters describing the volume
</li>
</ol>
</li>

<li>file system = file volume + code
</li>

<li>A HDD or flash storage based file volumes are persistent.
</li>

<li>A RAM-"disk" based file volumes are not persistent, but commonly
used.
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Operations</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>mkfs &#x2013; one a given partition, make an initial file volume.  Only
the root and lost+found directories are created. List of free
blocks etc initialized.  Different mkfs for different fs-designs:
mkfs.ext4, mkfs.vfat
</li>

<li>fsck &#x2013; check the integrity of a file volume.
</li>

<li>mount &#x2013; take an off-line file-volume and mount it on an existing
directory, called mount-point.  Depending on the options, the
previous contents of the mount-point becomes invisible.  The
file-volume appears instead.
</li>

<li>umount (sic) &#x2013; unmount, reverse of above.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> ext4</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>ext4 is a particular design of a Linux native file system.  Windows
"drivers" exist but may not be reliable.  You need to download and
install.
</li>

<li>ext4 is a journaling file system.
</li>

<li>Android formats its internal eMMC storage as ext4.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> vfat</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>vfat is a particular design of a Windows native file system.  Linux
is wholly reliable with it.  vfat is now a standard part of Linux.
</li>

<li>Android formats its internal flash eMMC storage as ext4, and
removable uSD cards as (typically) vfat.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Swap Space</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>A file volume designed for use in virtual memory (pages, segments).
</li>
<li>When swap space is exhausted, machine will "crawl"
</li>
<li>If machine has large amounts of physical memory (RAM), swap space
is unused.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Loop Device</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Simulation of a file as a block device
</li>
<li>file <code>ubuntu-trusty.iso</code> downloaded iso image
</li>

<li><code># mkdir -p /root/A</code> create mount point
</li>
<li><code># mount kubuntu-14.04-desktop-amd64.iso /root/A</code>
</li>

<li><code>% df</code> shows <code>/dev/loop1 1041408 1041408 0 100% /root/A</code>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="http://cecs.wright.edu/~pmateti/Courses/2350/">http://cecs.wright.edu/~pmateti/Courses/2350/</a> <i>CEG 2350: OS
Concepts and Usage</i> This course presents most of our prerequiste
materials.  Lecture and lab notes are fully on-line.

<p>
CEG 2350 Catalog Description: Introduction to Linux and Windows
systems. GUI and Windowing Systems. Files and
Directories. Ownership and Sharing. Programs and Processes. System
calls, Libraries. Loading. Dynamic linking. Command Line
Shells. Scripting languages. Regular expressions. Clients and
Servers. Web browser clients and servers. Secure shell,
sftp. SSL/TSL. HTTPS. System Administration. 4 credit hours. 3
hours lectures, 2 hours labs. Prerequisites: CS 1180 or CS 2170
(older numbers CS 240 or CS 220) or equivalent.
</p>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2014 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> 2015-08-10
</div>
</body>
</html>
